app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
  def index
    @properties = Property.all

INSERT INTO "properties" ("name", "rent", "address", "old", "remark", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "ほほほ"], ["rent", 1], ["address", "東京"], ["old", 1], ["remark", "いい家だ"], ["created_at", "2023-01-21 07:53:47.047177"], ["updated_at", "2023-01-21 07:53:47.047177"]]
---
  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save

UPDATE "properties" SET "remark" = ?, "updated_at" = ? WHERE "properties"."id" = ?  [["remark", "とてもいい部屋だよ"], ["updated_at", "2023-01-21 04:46:23.809984"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @property.update(property_params)

DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 1]]
---
  def destroy
    @property.destroy

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_property
      @property = Property.find(params[:id])